{"translation-revision-date":"2021-02-24 06:46:42+0000","generator":"GlotPress\/3.0.0-alpha.2","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","plural-forms":"nplurals=1; plural=0;","lang":"th"},"All":["ทั้งหมด"],"Submit":["ส่ง"],"Edit link":["แก้ไขลิงก์"],"Upload":["อัปโหลด"],"Styles":["สไตล์"],"Not set":["ยังไม่เสร็จ"],"Search Results":["ผลการค้นหา"],"Clear selection.":["ล้างค่าที่เลือกไว้"],"Tools":["เครื่องมือ"],"Text Color":["สีข้อความ"],"Blocks":["ปิดกั้น"],"Convert to HTML":["แปลงเป็น HTML"],"Current":["ปัจจุบัน"],"blocks\u0004Most used":["ใช้บ่อย"],"%d result found.":["%d ผลการค้นหาที่พบ"],"%d word":["%d คำ"],"No results.":["ไม่มีผลลัพธ์"],"%s block selected.":["%s บล็อกถูกเลือก"],"To edit this block, you need permission to upload media.":["คุณจำเป็นต้องมีสิทธิ์สำหรับอัปโหลดไฟล์สื่อ จึงจะแก้ไขบล็อกนี้ได้"],"Block tools":["เครื่องมือบล็อก"],"(selected block)":["(บล็อกที่ถูกเลือก)"],"Start writing or type \/ to choose a block":["เริ่มการเขียน หรือพิมพ์เครื่องหมายทับ (\/) เพื่อเลือกบล็อก"],"Block icon":["ไอคอนของบล็อก"],"Image dimensions":["ขนาดของรูปภาพ"],"Color settings":["การตั้งค่าสี"],"Document":["เอกสาร"],"Reusable blocks":["บล็อกใช้ซ้ำได้"],"Manage all reusable blocks":["จัดการบล็อกใช้ซ้ำได้ทั้งหมด"],"%d block":["%d บล็อก"],"Insert a new block before the selected block(s).":["แทรกบล็อกใหม่ก่อนหน้าบล็อกที่เลือก"],"Insert a new block after the selected block(s).":["แทรกบล็อกใหม่ถัดจากบล็อกที่เลือก"],"Remove the selected block(s).":["นำบล็อกที่เลือกออก"],"Duplicate the selected block(s).":["สำเนาบล็อกที่เลือก"],"Vivid red":["แดงสด"],"Pale pink":["ชมพูอ่อน"],"Luminous vivid orange":["ส้มสว่าง"],"Luminous vivid amber":["เหลือสว่าง"],"Skip to the selected block":["ข้ามไปยังบล็อกที่ถูกเลือก"],"Link settings":["ตั้งค่าลิงก์"],"Convert to Blocks":["แปลงเป็นบล็อก"],"Add block":["เพิ่มบล็อก"],"Change alignment":["เปลี่ยนการจัดตำแหน่ง"],"No block selected.":["ไม่มีบล็อกที่ถูกเลือก"],"Navigate to the nearest toolbar.":["นำทางไปยังแถบเครื่องมือที่ใกล้ที่สุด"],"Paste or type URL":["วางหรือพิมพ์ URL"],"Reusable":["ใช้ซ้ำได้"],"Block: %s":["บล็อก: %s"],"More options":["ตัวเลือกเพิ่มเติม"],"Select all text when typing. Press again to select all blocks.":["เลือกข้อความทั้งหมดในขณะที่พิมพ์ กดอีกครั้งเพื่อเลือกบล็อกทั้งหมด"],"font size name\u0004Huge":["ใหญ่มาก"],"font size name\u0004Large":["ใหญ่"],"font size name\u0004Medium":["ปานกลาง"],"font size name\u0004Small":["เล็ก"],"Cyan bluish gray":["สีเทาอมฟ้า"],"Vivid cyan blue":["สีน้ำเงินสด"],"Pale cyan blue":["สีน้ำเงินซีด"],"Vivid green cyan":["สีฟ้าอมเขียวสด"],"Light green cyan":["สีฟ้าอมเขียวอ่อน"],"Additional CSS class(es)":["CSS Class เพิ่มเติม"],"HTML anchor":["HTML Anchor"],"Search for a block":["ค้นหาบล็อก"],"Edit as HTML":["แก้ไขแบบ HTML"],"Reset":["ล้างค่า"],"Insert After":["แทรกต่อท้าย"],"Insert Before":["แทรกก่อนหน้า"],"font size name\u0004Normal":["ปานกลาง"],"This color combination may be hard for people to read. Try using a darker background color and\/or a brighter text color.":["คู่สีนี้อาจทำให้อ่านได้ยาก พยายามใช้สีพื้นหลังที่เข้มขึ้น และ\/หรือ ใช้สีตัวหนังสือที่สว่างขึ้น"],"This color combination may be hard for people to read. Try using a brighter background color and\/or a darker text color.":["คู่สีนี้อาจทำให้อ่านได้ยาก พยายามใช้สีพื้นหลังที่สว่างขึ้น และ\/หรือ ใช้สีตัวหนังสือที่เข้มขึ้น"],"Convert to Classic Block":["แปลงเป็นบล็อกดั้งเดิม"],"Full width":["กว้างเต็มจอ"],"Wide width":["กว้าง"],"Change text alignment":["เปลี่ยนการจัดตำแหน่งข้อความ"],"Change type of %d block":["เปลี่ยนประเภทของบล็อก %d"],"Move %1$s block from position %2$d down to position %3$d":["ย้ายบล็อก %1$s จากตำแหน่ง %2$d ลงไปยังตำแหน่ง %3$d"],"Block %s is the only block, and cannot be moved":["บล็อก %s เป็นบล็อกเดียวและไม่สามารถย้ายได้"],"This block contains unexpected or invalid content.":["บล็อกนี้มีสิ่งที่ไม่ได้คาดไว้หรือเนื้อหาที่ไม่ถูกต้อง"],"imperative verb\u0004Resolve":["แก้ปัญหา"],"Resolve Block":["แก้ปัญหาบล็อก"],"This block has encountered an error and cannot be previewed.":["บล็อกนี้มีข้อผิดพลาดเกิดขึ้นและไม่สามารถดูตัวอย่างได้"],"After Conversion":["หลังจากแปลงแล้ว"],"Move %1$d block from position %2$d down by one place":["เลื่อนบล็อก %1$d จากตำแหน่ง %2$d ลงไปขั้นหนึ่ง"],"Move %1$d block from position %2$d up by one place":["เลื่อนบล็อก %1$d จากตำแหน่ง %2$d ขึ้นไปขั้นหนึ่ง"],"Blocks cannot be moved down as they are already at the bottom":["บล็อกไม่สามารถเลื่อนลงไปได้เนื่องจากมันอยู่ด้านล่างสุดแล้ว"],"Blocks cannot be moved up as they are already at the top":["บล็อกไม่สามารถเลื่อนขึ้นไปได้เนื่องจากมันอยู่ด้านบนสุดแล้ว"],"Move %1$s block from position %2$d up to position %3$d":["เลื่อนบล็อก %1$s จากตำแหน่ง %2$d ขึ้นไปยังตำแหน่ง %3$d"],"Transform to":["แปลงเป็น:"],"Duplicate":["ทำสำเนา"],"Edit visually":["แก้ไขแบบเสมือนจริง"],"%d result found, use up and down arrow keys to navigate.":["พบ %d ผลลัพธ์ ใช้ลูกศรขึ้นหรือลงเพื่อนำทาง"],"block style\u0004Default":["ค่าเริ่มต้น"],"More rich text controls":["การควบคุม Rich Text เพิ่มเติม"],"Attempt Block Recovery":["กู้คืนบล๊อก"],"Change block type or style":["เปลี่ยนชนิดหรือรูปแบบบล็อก"],"No Preview Available.":["ไม่มีตัวอย่างการแสดงผล"],"Add a block":["เพิ่มบล็อก"],"Enter a word or two — without spaces — to make a unique web address just for this heading, called an “anchor.” Then, you’ll be able to link directly to this section of your page.":["พิมพ์คำโดยไม่เว้นช่องว่างเพื่อสร้าง web address ที่ชัดเจนสำหรับหัวข้อนี้ \nWeb address นี้เรียกว่า \"anchor\" จากนั้นคุณจะสามารถเข้าถืงส่วนนี้ของหน้านี้ได้โดยตรง"],"Learn more about anchors":["เรียนรู้เพื่อเติมเกี่ยวกับ anchors"],"Open in new tab":["เปิดในแท็บใหม่"],"Skip":["ข้าม"],"Upload a media file or pick one from your media library.":["อัปโหลดไฟล์สื่อหรือเลือกไฟล์สื่อจากคลังไฟล์สื่อของคุณ"],"Block vertical alignment setting label\u0004Change vertical alignment":["เปลี่ยนการจัดตำแหน่งแนวตั้ง"],"Upload an image file, pick one from your media library, or add one with a URL.":["อัปโหลดไฟล์รูป เลือกไฟล์รูปจากคลังสื่อของคุณ หรือเพิ่มไฟล์รูปโดยการเพิ่ม URL"],"Upload a video file, pick one from your media library, or add one with a URL.":["อัปโหลดไฟล์วิดีโอ เลือกไฟล์วิดีโอจากคลังสื่อของคุณ หรือเพิ่มไฟล์วิดีโอโดยการเพิ่ม URL"],"Upload an audio file, pick one from your media library, or add one with a URL.":["อัปโหลดไฟล์เสียง เลือกไฟล์เสียงจากคลังสื่อของคุณ หรือเพิ่มไฟล์เสียงโดยการเพิ่ม URL"],"Block %1$s is at the beginning of the content and can’t be moved left":["บล็อก %1$s อยู่ที่ตำแหน่งเริ่มต้นของเนื้อหาและไม่สามารถเลื่อนไปทางซ้ายได้"],"Block %1$s is at the beginning of the content and can’t be moved up":["บล็อก %1$s อยู่ที่ตำแหน่งเริ่มต้นของเนื้อหาและไม่สามารถเลื่อนขึ้นบนได้"],"Block %1$s is at the end of the content and can’t be moved left":["บล็อก %1$s อยู่ที่ตำแหน่งสุดท้ายของเนื้อหาและไม่สามารถเลื่อนไปทางซ้ายได้"],"Block %1$s is at the end of the content and can’t be moved down":["บล็อก %1$s อยู่ที่ตำแหน่งสุดท้ายของเนื้อหาและไม่สามารถเลื่อนลงล่างได้"],"Block %1$s is at the beginning of the content and can’t be moved right":["บล็อก %1$s อยู่ที่ตำแหน่งเริ่มต้นของเนื้อหาและไม่สามารถเลื่อนไปทางขวาได้"],"Block %1$s is at the end of the content and can’t be moved right":["บล็อก %1$s อยู่ที่ตำแหน่งสุดท้ายของเนื้อหาและไม่สามารถเลื่อนไปทางขวาได้"],"Remove multiple selected blocks.":["ลบบล็อกหลายอันที่เลือกไว้"],"Move %1$s block from position %2$d left to position %3$d":["ย้ายบล็อก%1$s จากตำแหน่ง %2$d ไปทางซ้ายยังตำแหน่ง %3$d"],"Move %1$s block from position %2$d right to position %3$d":["ย้ายบล็อก%1$s จากตำแหน่ง %2$d ไปทางขวายังตำแหน่ง %3$d"],"Tools offer different interactions for block selection & editing. To select, press Escape, to go back to editing, press Enter.":["เครื่องมือหลายอย่างมีการตอบสนองที่แตกต่างกันในการที่จะเลือกและแก้ไขบล็อก เพื่อที่จะเลือกให้กดปุ่ม Esc เพื่อที่จะกลับไปแก้ไขให้กดปุ่ม Enter"],"Toggle between using the same value for all screen sizes or using a unique value per screen size.":["สลับไปมาระหว่างการใช้ค่าเหมือนกันสำหรับขนาดหน้าจอทั้งหมด หรือใช้ค่าเฉพาะสำหรับแต่ละขนาดของหนึ่งหน้าจอ"],"Use the same %s on all screensizes.":["ใช้ %s เหมือนกันในทุกๆ ขนาดหน้าจอ"],"Large screens":["หน้าจอใหญ่"],"Medium screens":["หน้าจอกลาง"],"Small screens":["หน้าจอเล็ก"],"Text labelling a interface as controlling a given layout property (eg: margin) for a given screen size.\u0004Controls the %1$s property for %2$s viewports.":["ควบคุมคุณสมบัติ %1$s สำหรับวิวพอร์ต %2$s"],"Open Media Library":["เปิดคลังไฟล์สื่อ"],"The media file has been replaced":["ไฟล์สื่อถูกแทนที่แล้ว"],"Currently selected":["เลือกอยู่ ณ ตอนนี้"],"Recently updated":["อัปเดตล่าสุด"],"Search or type url":["ค้นหาหรือพิมพ์ url"],"Press ENTER to add this link":["กด ENTER เพื่อเพิ่มลิงก์นี้"],"Currently selected link settings":["ตั้งค่าลิงก์ที่เลือกอยู่ ณ ตอนนี้"],"Image size":["ขนาดรูปภาพ"],"Gradient Presets":["ชุดริเริ่มการไล่ระดับสี"],"Select a variation to start with.":["เลือกตัวแปรที่จะเริ่มใช้งาน"],"Choose variation":["เลือกตัวแปร"],"Generic label for block inserter button\u0004Add block":["เพิ่มบล็อก"],"directly add the only allowed block\u0004Add %s":["เพิ่ม %s"],"%s block added":["เพิ่มบล็อก%sแล้ว"],"Multiple selected blocks":["บล็อกหลายอันที่เลือกไว้"],"Midnight":["เที่ยงคืน"],"You are currently in edit mode. To return to the navigation mode, press Escape.":["คุณอยู่ในโหมดแก้ไข ณ ตอนนี้ กดปุ่ม Esc หากคุณต้องการจะกลับไปที่โหมดนำทาง"],"Electric grass":["หญ้าไฟฟ้า"],"Pale ocean":["มหาสมุทรสีจาง"],"Luminous dusk":["ฝุ่นเรืองแสง"],"Blush bordeaux":["บอร์โดหลากสี"],"Blush light purple":["ม่วงอ่อนเลื่อมลาย"],"Cool to warm spectrum":["สเปคตรัมเย็นถึงอุ่น"],"Very light gray to cyan bluish gray":["เทาอ่อนๆ ถึงเทาฟ้า"],"Luminous vivid orange to vivid red":["ส้มสว่างถึงแดงสดใส"],"Luminous vivid amber to luminous vivid orange":["เหลืองอำพันถึงส้มสว่าง"],"Light green cyan to vivid green cyan":["ฟ้าน้ำทะเลอ่อนถึงฟ้าเขียวใสสว่าง"],"Vivid cyan blue to vivid purple":["ฟ้าน้ำทะเลถึงม่วงสด"],"Block breadcrumb":["การโปรยบล็อก"],"(%s: gradient %s)":["(%s: ไล่ระดับ %s)"],"(%s: color %s)":["(%s: สี %s)"],"Gradient":["ไล่ระดับ"],"Solid":["ทึบ"],"(Gradient: %s)":["(ไล่ระดับ: %s)"],"(Color: %s)":["(สี: %s)"],"Block navigation":["นำทางบล็อก"],"Move right":["โยกขวา"],"Move left":["โยกซ้าย"],"Separate multiple classes with spaces.":["แยกคลาสหลายๆ อันด้วยช่องว่าง"],"Default Style":["สไตล์เริ่มต้น"],"This color combination may be hard for people to read.":["สีประสมอันนี้อาจจะยากต่อการอ่านของคนทั่วไป"],"While writing, you can press <kbd>\/<\/kbd> to quickly insert new blocks.":["ระหว่างพิมพ์ คุณสามารถกด <kbd>\/<\/kbd> เพื่อแทรกบล็อกใหม่"],"Vivid purple":["ม่วงสด"],"Block vertical alignment setting\u0004Vertically Align Top":["ชิดบน"],"Block vertical alignment setting\u0004Vertically Align Bottom":["ชิดล่าง"],"Block vertical alignment setting\u0004Vertically Align Middle":["ตั้งตรงกลาง"],"Align text right":["จัดข้อความชิดขวา"],"Align text center":["จัดข้อความตรงกลาง"],"Align text left":["จัดข้อความชิดซ้าย"],"Browse all":["ดูทั้งหมด"],"Remove blocks":["ลบบล็อก"],"Mobile":["มือถือ"],"Tablet":["แท็บเล็ต"],"Desktop":["เดสก์ท็อป"],"Go to block":["ไปที่บล็อก"],"Block %1$d of %2$d, Level %3$d":["บล็อก %1$d ของ %2$d, ระดับ %3$d"],"Edit":["แก้ไข"],"Advanced":["ขั้นสูง"],"Copy":["คัดลอก"],"Remove link":["เอาลิงก์ออก"],"Background Color":["สีพื้นหลัง"],"Align right":["ชิดขวา"],"Align left":["ชิดซ้าย"],"Paste URL or type to search":["วาง URL หรือพิมพ์เพื่อค้นหา"],"Align center":["กึ่งกลาง"],"Media":["สื่อ"],"Uncategorized":["ไม่มีหมวดหมู่"],"Select":["เลือก"],"Insert from URL":["ใส่ไฟล์จาก URL"],"Move down":["เลื่อนลง"],"Move up":["เลื่อนขึ้น"],"Apply":["นำไปใช้"],"Media Library":["คลังสื่อ"],"Preview":["ดูก่อน"],"Thumbnail":["รูปขนาดเล็ก"],"Medium":["ขนาดกลาง"],"Full Size":["เต็มขนาด"],"Black":["สีดำ"],"White":["สีขาว"],"Attachment Page":["หน้าไฟล์แนบ"],"Media File":["ไฟล์สื่อ"],"Large":["ขนาดใหญ่"],"Replace":["แทนที่"],"Width":["ความกว้าง"],"Height":["ความสูง"],"Link Rel":["ลิงก์ที่เกี่ยวข้อง"],"Audio":["ไฟล์เสียง"],"Video":["ไฟล์วีดีโอ "],"Link CSS Class":["ลิงก์ CSS Class"],"URL":["URL"],"No results found.":["ไม่พบผลลัพท์"],"Cancel":["ยกเลิก"],"Close":["ปิด"],"Insert link":["ใส่ลิงก์"],"Image":["รูปภาพ"],"Link selected.":["เลือกลิงก์แล้ว"]}},"comment":{"reference":"wp-includes\/js\/dist\/block-editor.js"}}